<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5e5657e51e05927e920537966d3f4661317201f04d91104dcb0193f5edf4fae1","plan_job_ref":"Job Terraform checks on pull request #27 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/11178996274","plan_out_hash":"a244ec48ab752098a67e483bb6e05618ce9771320742a1acc102582b292ed3e8","plan_hash":"4166ed166877ba28d979121927b9dcf11065caf17dffb110d8f90499427c84d3","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.terraform.modularised-demo"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.modularised-demo"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository.repository will be created
+   resource "github_repository" "repository" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = true
+       branches                    = (known after apply)
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "An example Terraform setup using modularised components to fulfill a use-case - repo managed by sudoblark.terraform.github"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_downloads               = true
+       has_issues                  = true
+       has_projects                = true
+       has_wiki                    = true
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "sudoblark.terraform.modularised-demo"
+       node_id                     = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "aws",
+           "demo",
+           "iac",
+           "terraform",
        ]
+       visibility                  = "private"
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.commit-to-pr[0] will be created
+   resource "github_repository_file" "commit-to-pr" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "commit-to-pr.yaml - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            
            name: Terraform checks on pull request
            
            env:
              AWS_ACCESS_KEY_ID: ${{ secrets.SUDOBLARK_AWS_ACCESS_KEY_ID }}
              AWS_SECRET_ACCESS_KEY: ${{ secrets.SUDOBLARK_AWS_ACCESS_KEY_VALUE }}
              AWS_DEFAULT_REGION: eu-west-2
              # Automatically generated token unique to this repo per workflow execution
              REPO_GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
              # Explicitly provided token in ORG to access entire organisation
              ORG_GITHUB_TOKEN: ${{ secrets.SUDOBLARK_GITHUB_TOKEN }}
            
            on: [pull_request]
            
            permissions:
              contents: read
              pull-requests: write
            
            jobs:
              validation:
                strategy:
                  matrix:
                    folder: ["add", "folders", "here"]
                name: Terraform validate for ${{ matrix.folder }}
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v3
                    env:
                      GITHUB_TOKEN: ${{ env.REPO_GITHUB_TOKEN }}
            
                  - name: terraform validate
                    uses: dflook/terraform-validate@v1
                    with:
                      path: ${{ matrix.folder }}
            
                    env:
                      GITHUB_TOKEN: ${{ env.ORG_GITHUB_TOKEN }}
                      TERRAFORM_HTTP_CREDENTIALS: |
                        github.com/sudoblark=sudoblark-bot:${{ env.ORG_GITHUB_TOKEN }}
            
              linting:
                strategy:
                  matrix:
                    folder: ["add", "folders", "here"]
                name: Terraform lint for ${{ matrix.folder }}
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v3
                    env:
                      GITHUB_TOKEN: ${{ env.REPO_GITHUB_TOKEN }}
            
                  - name: Install tflint
                    uses: terraform-linters/setup-tflint@v3
            
                  - name: Run tflint
                    run: tflint
                    working-directory: ${{ matrix.folder }}
            
              plan:
                strategy:
                  matrix:
                    folder: ["add", "folders", "here"]
                name: Terraform plan for ${{ matrix.folder }}
                runs-on: ubuntu-20.04
                needs: [validation, linting]
                steps:
                  - uses: actions/checkout@v3
                    env:
                      GITHUB_TOKEN: ${{ env.REPO_GITHUB_TOKEN }}
            
                  - id: install-aws-cli
                    uses: unfor19/install-aws-cli-action@v1
            
                  - name: terraform plan
                    uses: dflook/terraform-plan@v1
                    with:
                      path: ${{ matrix.folder }}
                    env:
                      GITHUB_TOKEN: ${{ env.ORG_GITHUB_TOKEN }}
                      TERRAFORM_HTTP_CREDENTIALS: |
                        github.com/sudoblark=sudoblark-bot:${{ env.ORG_GITHUB_TOKEN }}
        EOT
+       file                = ".github/workflows/commit-to-pr.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.gitignore will be created
+   resource "github_repository_file" "gitignore" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".gitignore - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Created by .ignore support plugin (hsz.mobi)
            ### Python template
            # Byte-compiled / optimized / DLL files
            __pycache__/
            *.py[cod]
            *$py.class
            
            # C extensions
            *.so
            
            # Distribution / packaging
            .Python
            env/
            build/
            develop-eggs/
            dist/
            downloads/
            eggs/
            .eggs/
            lib/
            lib64/
            parts/
            sdist/
            var/
            *.egg-info/
            .installed.cfg
            *.egg
            
            # PyInstaller
            #  Usually these files are written by a python script from a template
            #  before PyInstaller builds the exe, so as to inject date/other infos into it.
            *.manifest
            *.spec
            
            # Installer logs
            pip-log.txt
            pip-delete-this-directory.txt
            
            # Unit test / coverage reports
            htmlcov/
            .tox/
            .coverage
            .coverage.*
            .cache
            nosetests.xml
            coverage.xml
            *,cover
            .hypothesis/
            
            # Translations
            *.mo
            *.pot
            
            # Django stuff:
            *.log
            local_settings.py
            
            # Flask stuff:
            instance/
            .webassets-cache
            
            # Scrapy stuff:
            .scrapy
            
            # Sphinx documentation
            docs/_build/
            
            # PyBuilder
            target/
            
            # IPython Notebook
            .ipynb_checkpoints
            
            # pyenv
            .python-version
            
            # celery beat schedule file
            celerybeat-schedule
            
            # dotenv
            .env
            
            # virtualenv
            venv/
            ENV/
            
            # Spyder project settings
            .spyderproject
            
            # Rope project settings
            .ropeproject
            ### VirtualEnv template
            # Virtualenv
            # http://iamzed.com/2009/05/07/a-primer-on-virtualenv/
            [Bb]in
            [Ii]nclude
            [Ll]ib
            [Ll]ib64
            [Ll]ocal
            [Ss]cripts
            pyvenv.cfg
            .venv
            pip-selfcheck.json
            
            ### JetBrains template
            # Covers JetBrains IDEs: IntelliJ, RubyMine, PhpStorm, AppCode, PyCharm, CLion, Android Studio, WebStorm and Rider
            # Reference: https://intellij-support.jetbrains.com/hc/en-us/articles/206544839
            
            # User-specific stuff
            .idea/**/workspace.xml
            .idea/**/tasks.xml
            .idea/**/usage.statistics.xml
            .idea/**/dictionaries
            .idea/**/shelf
            
            # AWS User-specific
            .idea/**/aws.xml
            
            # Generated files
            .idea/**/contentModel.xml
            
            # Sensitive or high-churn files
            .idea/**/dataSources/
            .idea/**/dataSources.ids
            .idea/**/dataSources.local.xml
            .idea/**/sqlDataSources.xml
            .idea/**/dynamic.xml
            .idea/**/uiDesigner.xml
            .idea/**/dbnavigator.xml
            
            # Gradle
            .idea/**/gradle.xml
            .idea/**/libraries
            
            # Gradle and Maven with auto-import
            # When using Gradle or Maven with auto-import, you should exclude module files,
            # since they will be recreated, and may cause churn.  Uncomment if using
            # auto-import.
            # .idea/artifacts
            # .idea/compiler.xml
            # .idea/jarRepositories.xml
            # .idea/modules.xml
            # .idea/*.iml
            # .idea/modules
            # *.iml
            # *.ipr
            
            # CMake
            cmake-build-*/
            
            # Mongo Explorer plugin
            .idea/**/mongoSettings.xml
            
            # File-based project format
            *.iws
            
            # IntelliJ
            out/
            
            # mpeltonen/sbt-idea plugin
            .idea_modules/
            
            # JIRA plugin
            atlassian-ide-plugin.xml
            
            # Cursive Clojure plugin
            .idea/replstate.xml
            
            # SonarLint plugin
            .idea/sonarlint/
            
            # Crashlytics plugin (for Android Studio and IntelliJ)
            com_crashlytics_export_strings.xml
            crashlytics.properties
            crashlytics-build.properties
            fabric.properties
            
            # Editor-based Rest Client
            .idea/httpRequests
            
            # Android studio 3.1+ serialized cache file
            .idea/caches/build_file_checksums.ser
            
            # idea folder, uncomment if you don't need it
            .idea
            
            ### Terraform template
            # Local .terraform directories
            **/.terraform/*
            
            # .tfstate files
            *.tfstate
            *.tfstate.*
            
            # Crash log files
            crash.log
            crash.*.log
            
            # Exclude all .tfvars files, which are likely to contain sensitive data, such as
            # password, private keys, and other secrets. These should not be part of version
            # control as they are data points which are potentially sensitive and subject
            # to change depending on the environment.
            *.tfvars
            *.tfvars.json
            
            # Ignore override files as they are usually used to override resources locally and so
            # are not checked in
            override.tf
            override.tf.json
            *_override.tf
            *_override.tf.json
            
            # Include override files you do wish to add to version control using negated pattern
            # !example_override.tf
            
            # Include tfplan files to ignore the plan output of command: terraform plan -out=tfplan
            # example: *tfplan*
            
            # Ignore CLI configuration files
            .terraformrc
            terraform.rc
            # Lock file automatically managed by Terraform
            **/.terraform.lock.hcl
            
            # PyTest
            **/.pytest_cache
            .vscode/settings.json
            
            # MacOS
            .DS_Store
            .ado/templates/query_status.json
            
            # Temp dev files
            dev_scratchpad/*
        EOT
+       file                = ".gitignore"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.license will be created
+   resource "github_repository_file" "license" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "license.txt - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            Copyright (c) 2024, Sudoblark Ltd
            All rights reserved.
            
            Redistribution and use in source and binary forms, with or without
            modification, are permitted provided that the following conditions are met:
            
            * Redistributions of source code must retain the above copyright notice, this
              list of conditions and the following disclaimer.
            
            * Redistributions in binary form must reproduce the above copyright notice,
              this list of conditions and the following disclaimer in the documentation
              and/or other materials provided with the distribution.
            
            * Neither the name of the copyright holder nor the names of its
              contributors may be used to endorse or promote products derived from
              this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
+       file                = "LICENSE.txt"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.precommit will be created
+   resource "github_repository_file" "precommit" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = ".pre-commit-config.yaml - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            
            
            fail_fast: true
            default_stages: [commit]
            repos:
              - repo: https://github.com/pre-commit/pre-commit-hooks
                rev: v4.5.0
                hooks:
                  - id: check-ast
                  - id: check-added-large-files
                  - id: check-case-conflict
                  - id: check-shebang-scripts-are-executable
                  - id: check-merge-conflict
                  - id: detect-private-key
                  - id: debug-statements
                  - id: detect-aws-credentials
                    args:
                      - --allow-missing-credentials
                  - id: mixed-line-ending
                  - id: trailing-whitespace
              - repo: https://github.com/bridgecrewio/checkov.git
                rev: 3.2.50
                hooks:
                  - id: checkov
                    verbose: false
                    args: [--soft-fail]
              - repo: https://github.com/antonbabenko/pre-commit-terraform
                rev: v1.94.3
                hooks:
                  - id: terraform_fmt
                  - id: terraform_validate
        EOT
+       file                = ".pre-commit-config.yaml"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.pull-request-template will be created
+   resource "github_repository_file" "pull-request-template" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "pull_request_template.md - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Description
            
            Please include a summary of the changes and the related issue. Please also include relevant motivation and context. List any dependencies that are required for this change.
            
            Fixes # (issue)
            
            ## Type of change
            
            Please delete options that are not relevant.
            
            - [ ] Bug fix (non-breaking change which fixes an issue)
            - [ ] New feature (non-breaking change which adds functionality)
            - [ ] Breaking change (fix or feature that would cause existing functionality to not work as expected)
            - [ ] This change requires a documentation update
            
            # How Has This Been Tested?
            
            Please describe the tests that you ran to verify your changes. Provide instructions so we can reproduce. Please also list any relevant details for your test configuration
            
            - [ ] Test A
            - [ ] Test B
            
            # Checklist:
            
            - [] My code follows the style guidelines of this project
            - [] I have made corresponding changes to the documentation
            
            - [] Terraform validate works locally
            - [] Terraform plan passes in the pipeline with an expected result
            - [] Terraform plan does not show any unsuspected terraform destroy operations
        EOT
+       file                = ".github/pull_request_template.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.readme will be created
+   resource "github_repository_file" "readme" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "README.md - initial creation by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # sudoblark.terraform.modularised-demo
            An example Terraform setup using modularised components to fulfill a use-case - repo managed by sudoblark.terraform.github
        EOT
+       file                = "README.md"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

  # module.repositories["sudoblark.terraform.modularised-demo"].github_repository_file.repository_codeowners_file will be created
+   resource "github_repository_file" "repository_codeowners_file" {
+       branch              = "main"
+       commit_author       = (known after apply)
+       commit_email        = (known after apply)
+       commit_message      = "CODEOWNERS - managed by sudoblark.terraform.github"
+       commit_sha          = (known after apply)
+       content             = <<-EOT
            # Default owners for all the things in the repo - managed by sudoblark.terraform.github
            * @benjaminlukeclark
        EOT
+       file                = ".github/CODEOWNERS"
+       id                  = (known after apply)
+       overwrite_on_create = true
+       repository          = "sudoblark.terraform.modularised-demo"
+       sha                 = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #27](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/11178996274)